poc/results/x-cross/chaos/crdb-vm-6node-P-B-aa-rc-20260808T220127+0800-chaos/scenarioC7/fio-summary.txt
chaos-c7-contention: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.19
Starting 4 processes
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
[...]

chaos-c7-contention: (groupid=0, jobs=4): err= 0: pid=3782: Sat Aug  8 23:09:53 2026
  write: IOPS=41.7k, BW=163MiB/s (171MB/s)(4888MiB/30042msec); 0 zone resets
    slat (nsec): min=1517, max=83979k, avg=73535.96, stdev=1602300.23
    clat (usec): min=221, max=106332, avg=6071.10, stdev=13758.02
     lat (usec): min=242, max=106345, avg=6144.74, stdev=13835.56
    clat percentiles (usec):
     |  1.00th=[   529],  5.00th=[   734], 10.00th=[   922], 20.00th=[  1188],
     | 30.00th=[  1483], 40.00th=[  1893], 50.00th=[  2442], 60.00th=[  2999],
     | 70.00th=[  3556], 80.00th=[  4228], 90.00th=[  6390], 95.00th=[ 41157],
     | 99.00th=[ 69731], 99.50th=[ 72877], 99.90th=[ 78119], 99.95th=[ 81265],
     | 99.99th=[102237]
   bw (  KiB/s): min=106864, max=326772, per=100.00%, avg=166848.29, stdev=9497.93, samples=236
   iops        : min=26716, max=81691, avg=41712.02, stdev=2374.45, samples=236
  lat (usec)   : 250=0.01%, 500=0.72%, 750=4.66%, 1000=7.38%
  lat (msec)   : 2=29.36%, 4=34.77%, 10=15.19%, 20=2.15%, 50=1.51%
  lat (msec)   : 100=4.25%, 250=0.01%
  cpu          : usr=1.13%, sys=7.90%, ctx=112730, majf=0, minf=60
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,1251364,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=163MiB/s (171MB/s), 163MiB/s-163MiB/s (171MB/s-171MB/s), io=4888MiB (5126MB), run=30042-30042msec

Disk stats (read/write):
  sda: ios=0/1601634, merge=0/82166, ticks=0/1417709, in_queue=1417709, util=33.16%